export const AVATARS = [
  "🐯", "🦁", "🦄", "🐼", "🐸", "🐵", "🐨", "🐰", "🐱",
  "🐮", "🐔", "🐧", "🐦", "🐤", "🦉", "🦅", "🐢", "🐍",
  "🐙", "🦕", "🦖", "🐳", "🐬", "🐠", "🦋", "🐝", "🐞",
  "🐲", "🐉", "🦊", "🦝", "🦓", "🦒", "🦘", "🦔", "🦦", "🦥"
];

export const DEFAULT_NAMES = [
  "จิรพัฒน์","ชยพล","ชวนากร","ณัฐชนน","ณัฐนันท์","ธนโชติ","พัสกร","ธรณินทร์","นภัสกร","ปิโยรส",
  "พิชิต","ภัทรธร","ภาวัต","วชิรวิชญ์","ศักดิธัช","ศุภณัฐ","กัญญ์วรา","กันตพร","กิรณา","จิรชญาดา",
  "จิราพัช","ฐริตา","ปภาดา","ปภาวรินท์","ปรีดานันท์","เปมิกา","พิชญ์ลลิดา","ภัทรภร","อลิสา","กนกพงศ์",
  "กฤตเมธ","ก้องภพ","เกริกฤทธิ์","เตชินท์","ธนกร","ธนวรรธน์","ปุณยวีร์","พัชรกูล","ภานุวัฒน์","วชิรวิชญ์",
  "วสุวัญญ์","ศตคุณ","อติเทพ","อรงณ์กร","จิราพัชร","โจโซฟิน","ณิชนันทน์","ธัญพิชชา","นันท์นภัส","ผกากรอง",
  "โยสิตา","รัชนีวรรณ","รุ่งนิภา","วชิรญาณ์","วรัทธิตา","วิลาสินี","สุประวีณ์"
];

export const MAX_SCORE = 100;

export const STORAGE_KEY = "studentScores";

// เสียงที่จะเล่นเมื่อได้คะแนน
export const SOUND_CONFIG = {
  dingSound: "/ding.mp3",
  volume: 0.5,
  preload: "auto"
};